#MIXIK TOKEN
TOKEN = ''

commandsList = (
    "<b>🛠COMMANDS🎭</b> \n\n" 
    "• <b>/help</b> - <i>список команд та інформації по них</i> \n\n" 
    "• <b>/new</b> - <i>додати нову згадку про день народження</i> \n\n"
    "• <b>/list</b> - <i>вивести список днів народження</i> \n\n"
    "• <b>/delete</b> - <i>видалити день народження із бази даних\nПримітка:\nдля коректної роботи використовуйте команду <code>/delete id</code> - де параметр \"id\" є порядковим номером запису\n(усі записи чату можна переглянути за допомогою команди <code>/list</code>) </i>\n\n"
)

birthdayGifs = [
   #Fudzivara dance
   'https://media.giphy.com/media/RLJxQtX8Hs7XytaoyX/giphy.gif',
   #Chuck Noris
   'https://media.giphy.com/media/oBPOP48aQpIxq/giphy.gif',
   #Clapping Applause GIF By The Gentlemen
   'https://media.giphy.com/media/WUmwGKySIjs8L7oYn9/giphy.gif',
   #Gentlemen open the car
   'https://media.giphy.com/media/XE7HOP9gIzwik3ND6F/giphy.gif',
   #DIKAPRIO HEAD MOVEMENT
   'https://media.giphy.com/media/yprjFmpQnihhRZvHv0/giphy.gif',
   #THE LEGEND: flovers
   'https://media.giphy.com/media/b26xrSmDzn5fO/giphy.gif',
   #DRUNK musician
   'https://media.giphy.com/media/3ohzdHa8nODi4IWIww/giphy.gif',
   #SCREAM wazzap
   'https://media.giphy.com/media/101DNxoBTatF16/giphy.gif'
]

birthdayText = [
    "Вітаю, щастя здоров'я тобі бажаю, щоб ніколи не було запору, щоб все йшло по плану, а не по пезді. Хай завжди все виходить у тебе і хай фортуна ніколи не повертається до тебе дупою.",
    "Вітаю, щастя, здоров'я, многая літа, діточок як на небі зірочок, щоб всі бажання збувались, щоб все в тебе було і нічого за це тобі не було, щоб песос стояв і серце билось.",
    # "Якщо щось згадаю, то напишу...",
    "Вітаю тебе із днем народження, щоб в цей день твоя найжаданіша мрія здійснилася, щоб ніколи на довго не затримувалася чорна смужка в твоєму житті, щоб не забував(ла) про важливі плани й рідних. Нехай кожний день принесе тобі незабутні враження, щоб цінував(ла) кожен момент в своєму житті ну і здоров'я, його не вернеш.",
    "200 гривень",
    f"З Днем народження!!! 🎊🎂🎈🎊 Всього найкращого 🥳🥳🥳"
]

nogifs = [
    #Hunnem no
    'https://media.giphy.com/media/YPDm9ybXqDLNB9XL3T/giphy.gif',
    #Hunnem turns
    'https://media.giphy.com/media/QYXltyeyluyvfKwfxU/giphy.gif'
]